## This script is based on SQL tutorial by [Khan Academy](https://www.khanacademy.org/computing/computer-programming/sql)

The code is modified for python script

## INDEX

[Section1: Creating table in SQL](#sec1)

[Section 2: Querying with SQLite](#sec2)

[Section3: Using `CASE` to create new variables](#sec3)

[Section 4: AGGREGATE FUNCTIONS](#sec4)

[Section 5: Subqueries](#sec5)

[Section 6: Updating or Deleting Data From rows](#sec6)

[Section 7: JOINing related tables](#sec7)

[Section 8: Writing Transactions](#sec8)

<a id="sec1"></a>

### Section 1: Creating table in SQL

In [36]:
## setting up connection
import sqlite3
con= sqlite3.connect('example_sql.db') # Here the data will be stored in example.db
# Once you have connection, you can create a Cursor object and call its execute() method to perform SQL commands
cur= con.cursor()

I'm creating a table called **stock** which has columns- `id` (INT) which is also the *primary key* or unique identifier, `date` (TXT), `trans` (TXT), `symbol` (TXT), `price` (FLOAT).

In [28]:
# Create a table
cur.execute('''CREATE TABLE stock (id integer primary key, date text, trans text, symbol text, qty real, price real) ''')

In [38]:
# Insert a row of data
# Make sure it has as many elements as the number of columns created in the table
cur.execute("INSERT INTO stock VALUES(1, '2006-01-05', 'BUY', 'RHAT', 100, 35.14)")

In [39]:
## Adding more data points
cur.execute("INSERT INTO stock VALUES(2, '2006-03-28', 'BUY', 'IBM', 1000, 45.0)")
cur.execute("INSERT INTO stock VALUES(3, '2006-04-06', 'SELL', 'IBM', 500, 53.0)")
cur.execute("INSERT INTO stock VALUES(4, '2006-04-05', 'BUY', 'MSFT', 1000, 72.2)")
cur.execute("INSERT INTO stock VALUES(5, '2006-03-31', 'BUY', 'MSFT', 1000, 10.0)")

In [40]:
## Looking at the table
for row in cur.execute("SELECT * FROM stock"):
    print(row)

(1, '2006-01-05', 'BUY', 'RHAT', 100.0, 35.14)
(2, '2006-03-28', 'BUY', 'IBM', 1000.0, 45.0)
(3, '2006-04-06', 'SELL', 'IBM', 500.0, 53.0)
(4, '2006-04-05', 'BUY', 'MSFT', 1000.0, 72.2)
(5, '2006-03-31', 'BUY', 'MSFT', 1000.0, 10.0)

In [41]:
## Another way to look at the table
list(cur.execute("SELECT * FROM stock"))

[(1, '2006-01-05', 'BUY', 'RHAT', 100.0, 35.14),
 (2, '2006-03-28', 'BUY', 'IBM', 1000.0, 45.0),
 (3, '2006-04-06', 'SELL', 'IBM', 500.0, 53.0),
 (4, '2006-04-05', 'BUY', 'MSFT', 1000.0, 72.2),
 (5, '2006-03-31', 'BUY', 'MSFT', 1000.0, 10.0)]

In [42]:
## Third way of looking at the table
cur.execute("SELECT * FROM stock")
print(cur.fetchall())

[(1, '2006-01-05', 'BUY', 'RHAT', 100.0, 35.14), (2, '2006-03-28', 'BUY', 'IBM', 1000.0, 45.0), (3, '2006-04-06', 'SELL', 'IBM', 500.0, 53.0), (4, '2006-04-05', 'BUY', 'MSFT', 1000.0, 72.2), (5, '2006-03-31', 'BUY', 'MSFT', 1000.0, 10.0)]

The above views do not show the column names. In case, you want to fetch column names, use the following command:

In [52]:
cur.execute('PRAGMA TABLE_INFO(stock)')
names = [tup[1] for tup in cur.fetchall()]
print(names)

['id', 'date', 'trans', 'symbol', 'qty', 'price']

In [19]:
## Save or commit changes
#con.commit()

<a id="sec2"></a>

### Section 2: Querying with SQLite

#### Selecting a particular column

In [43]:
## Querying column symbol
for row in cur.execute("SELECT symbol FROM stock"):
    print(row)

('RHAT',)
('IBM',)
('IBM',)
('MSFT',)
('MSFT',)

In [45]:
# Alternatively, 
list(cur.execute("SELECT symbol FROM stock"))

[('RHAT',), ('IBM',), ('IBM',), ('MSFT',), ('MSFT',)]

#### Sorting by a variable

In [20]:
## Querying column symbol ordered by price in ascending order
for row in cur.execute("SELECT symbol FROM stock ORDER BY price"):
    print(row)

('MSFT',)
('RHAT',)
('IBM',)
('IBM',)
('MSFT',)

In [47]:
## Alternatively,
for row in cur.execute("SELECT symbol FROM stock ORDER BY price ASC"):
    print(row)

('MSFT',)
('RHAT',)
('IBM',)
('IBM',)
('MSFT',)

In [46]:
## Querying column symbol ordered by price in descending order
for row in cur.execute("SELECT symbol FROM stock ORDER BY price DESC"):
    print(row)

('MSFT',)
('IBM',)
('IBM',)
('RHAT',)
('MSFT',)

#### Conditional Statements/ Filtering using `OR`

In [48]:
## Querying column symbol ordered by price with filtering on symbol being either "MSFT" or "IBM"
for row in cur.execute("SELECT date, trans FROM stock WHERE symbol='MSFT' OR symbol='IBM'   ORDER BY price"):
    print(row)

('2006-03-31', 'BUY')
('2006-03-28', 'BUY')
('2006-04-06', 'SELL')
('2006-04-05', 'BUY')

#### Conditional Statements/ Filtering using `IN`

In [49]:
## Alternatively,
for row in cur.execute("SELECT date, trans FROM stock WHERE symbol IN ('MSFT', 'IBM') ORDER BY price"):
    print(row)

('2006-03-31', 'BUY')
('2006-03-28', 'BUY')
('2006-04-06', 'SELL')
('2006-04-05', 'BUY')

In [50]:
## NOT IN
for row in cur.execute("SELECT date, trans FROM stock WHERE symbol NOT IN ('MSFT', 'IBM') ORDER BY price"):
    print(row)

('2006-01-05', 'BUY')

#### Conditional Statements/ Filtering using `AND`

In [51]:
## Querying column symbol ordered by price
for row in cur.execute("SELECT date, trans FROM stock WHERE symbol='MSFT' AND price> 50   ORDER BY price"):
    print(row)

('2006-04-05', 'BUY')

<a id="sec3"></a>

### Section 3: Using `CASE` to create new variables

#### Creating a factor variable

I'm creating a new variable- **qty_des** that takes value *jackpot* if qty is greater than 1000 and is empty otheriwse

In [53]:
for row in cur.execute("SELECT qty, price, CASE WHEN qty=1000 THEN 'jackpot' WHEN qty NOT IN (1000) THEN ' ' END 'qty_des' FROM stock ORDER BY price"):
    print(row)

(1000.0, 10.0, 'jackpot')
(100.0, 35.14, ' ')
(1000.0, 45.0, 'jackpot')
(500.0, 53.0, ' ')
(1000.0, 72.2, 'jackpot')

In [54]:
## However notice that nothing has changed in the original table
for row in cur.execute("SELECT * FROM stock"):
    print(row)

(1, '2006-01-05', 'BUY', 'RHAT', 100.0, 35.14)
(2, '2006-03-28', 'BUY', 'IBM', 1000.0, 45.0)
(3, '2006-04-06', 'SELL', 'IBM', 500.0, 53.0)
(4, '2006-04-05', 'BUY', 'MSFT', 1000.0, 72.2)
(5, '2006-03-31', 'BUY', 'MSFT', 1000.0, 10.0)

So variable qty_des is not created within data; later we'll see how to add this variable in the table itself

#### Creating a dummy variable

This time variable **qty_des** takes value 1 if qty is exactly 1000 and 0 otherwise

In [55]:
for row in cur.execute("SELECT qty, price, CASE WHEN qty=1000 THEN 1 WHEN qty NOT IN (1000) THEN 0 END 'qty_des' FROM stock ORDER BY price"):
    print(row)

(1000.0, 10.0, 1)
(100.0, 35.14, 0)
(1000.0, 45.0, 1)
(500.0, 53.0, 0)
(1000.0, 72.2, 1)

<a id="sec4"></a>

### Section 4: AGGREGATE FUNCTIONS

We'll be using some of the aggregate functions like `SUM`, `AVG`, `COUNT`, `MAX`, `MIN` below

In [58]:
for row in cur.execute("SELECT SUM(price) FROM stock"):
    print(row)

(215.33999999999997,)

In [59]:
for row in cur.execute("SELECT AVG(price) FROM stock"):
    print(row)

(43.068,)

In [60]:
for row in cur.execute("SELECT MAX(price) FROM stock"):
    print(row)

(72.2,)

In [61]:
for row in cur.execute("SELECT MIN(price) FROM stock"):
    print(row)

(10.0,)

#### Combining Aggregate Function with `GROUP BY`

In [62]:
for row in cur.execute("SELECT symbol, SUM(price) FROM stock GROUP BY symbol"):
    print(row)

('IBM', 98.0)
('MSFT', 82.2)
('RHAT', 35.14)

#### Combining Aggregate Function with `GROUP BY` and filtering on the aggregated function (`HAVING`)

In [63]:
for row in cur.execute("SELECT symbol, SUM(price) FROM stock GROUP BY symbol HAVING SUM(price)>50"):
    print(row)

('IBM', 98.0)
('MSFT', 82.2)

One can rename the column created as a result of aggregate function using `AS`

In [101]:
for row in cur.execute("SELECT symbol, SUM(price) AS tot_price FROM stock GROUP BY symbol HAVING tot_price>50"):
    print(row)

('IBM', 98.0)

#### If we use `WHERE` on aggregate function, then it will check each row of raw data and not that of aggregated value

In [64]:
for row in cur.execute("SELECT SUM(price) AS total_price_paid_above50 FROM stock WHERE price>50"):
    print(row)

(125.2,)

#### Finding and calculating the number of Unique elements of a variable

In [66]:
cur.execute("SELECT DISTINCT symbol FROM stock")
print(cur.fetchall())

[('RHAT',), ('IBM',), ('MSFT',)]

In [98]:
cur.execute("SELECT COUNT(DISTINCT symbol) AS unique_symbol FROM stock")
print(cur.fetchall())

[(3,)]

Check the Documentation for more functions here: https://www.khanacademy.org/computing/computer-programming/sql/sql-basics/pt/aggregating-data

#### Creating factor/Dummy variables based on aggregate functions

In [67]:
### Creating dummy for above average prices
for row in cur.execute("SELECT AVG(price) FROM stock"):
    mean_price= row[0]
print(mean_price)
### Using named style method for placeholders
for row in cur.execute("SELECT price, CASE WHEN price>= :x THEN 1 WHEN price < :x THEN 0 END as 'above_mean_price' FROM stock ORDER BY price", {"x" : mean_price}):
    print(row)

43.068
(10.0, 0)
(35.14, 0)
(45.0, 1)
(53.0, 1)
(72.2, 1)

In [68]:
## creating a dummy variable for buy/sell based on variable trans
### Using question mark method for placeholders
for row in cur.execute("SELECT trans, CASE WHEN trans=? THEN 1 WHEN trans =? THEN 0 END 'buy_sell' FROM stock ORDER BY price", ["BUY", "SELL"]):
    print(row)

('BUY', 1)
('BUY', 1)
('BUY', 1)
('SELL', 0)
('BUY', 1)

In [69]:
# Counting nos. of buys and sells
cur.execute("SELECT COUNT(*), CASE WHEN trans=? THEN 1 WHEN trans =? THEN 0 END 'buy_sell' FROM stock GROUP BY buy_sell", ["BUY", "SELL"])
print(cur.fetchall())

[(1, 0), (4, 1)]

Question mark method cannot be used with numerical/float placeholder

<a id="sec5"></a>

### Section 5: Subqueries

Creating a new table- **markets**, with columns `id`, `price`, `mkt_senti`

In [70]:
# Create a table
cur.execute('''CREATE TABLE markets (id integer primary key, price real, mkt_senti text) ''')

In [71]:
## Adding more data points
cur.execute("INSERT INTO markets VALUES(1, 35.14, 'BULL')")
cur.execute("INSERT INTO markets VALUES(2, 45.0, 'BEAR')")
cur.execute("INSERT INTO markets VALUES(3, 53.0, 'BEAR')")
cur.execute("INSERT INTO markets VALUES(4, 15.1, 'BULL')")

In [72]:
list(cur.execute("SELECT * FROM markets"))

[(1, 35.14, 'BULL'), (2, 45.0, 'BEAR'), (3, 53.0, 'BEAR'), (4, 15.1, 'BULL')]

Subqueries mean that the conditional statement could be based on a query on another table

In [73]:
## Subqueries
cur.execute("SELECT * FROM stock WHERE price IN (SELECT price FROM markets)")
print(cur.fetchall())

[(1, '2006-01-05', 'BUY', 'RHAT', 100.0, 35.14), (2, '2006-03-28', 'BUY', 'IBM', 1000.0, 45.0), (3, '2006-04-06', 'SELL', 'IBM', 500.0, 53.0)]

In [74]:
## Subqueries
cur.execute("SELECT * FROM stock WHERE price IN (SELECT price FROM markets WHERE price>50)") # price>50 is evaluated for price variable in markets
print(cur.fetchall())

[(3, '2006-04-06', 'SELL', 'IBM', 500.0, 53.0)]

In [75]:
## Subqueries
cur.execute("SELECT * FROM stock WHERE price IN (SELECT price FROM markets WHERE price=53.1)")
print(cur.fetchall())

[]

In [76]:
## Subqueries(Inexact matches)
cur.execute("SELECT * FROM stock WHERE price IN (SELECT price FROM markets WHERE mkt_senti LIKE '%BU%')") # % sign is a wildcard holder, ie, there could be anything in froint and back of BU
print(cur.fetchall())

[(1, '2006-01-05', 'BUY', 'RHAT', 100.0, 35.14)]

In [133]:
## Save or commit changes
#con.commit()

<a id="sec6"></a>

### Section 6: Updating or Deleting Data from rows

#### Updating value of a particular column in a specific row

In [77]:
cur.execute("UPDATE stock SET price= 25.00 WHERE id=4")
## Looking at the table
for row in cur.execute("SELECT * FROM stock"):
    print(row)

(1, '2006-01-05', 'BUY', 'RHAT', 100.0, 35.14)
(2, '2006-03-28', 'BUY', 'IBM', 1000.0, 45.0)
(3, '2006-04-06', 'SELL', 'IBM', 500.0, 53.0)
(4, '2006-04-05', 'BUY', 'MSFT', 1000.0, 25.0)
(5, '2006-03-31', 'BUY', 'MSFT', 1000.0, 10.0)

#### Deleting a row

In [78]:
cur.execute("DELETE FROM stock WHERE id=4")
## Looking at the table
for row in cur.execute("SELECT * FROM stock"):
    print(row)

(1, '2006-01-05', 'BUY', 'RHAT', 100.0, 35.14)
(2, '2006-03-28', 'BUY', 'IBM', 1000.0, 45.0)
(3, '2006-04-06', 'SELL', 'IBM', 500.0, 53.0)
(5, '2006-03-31', 'BUY', 'MSFT', 1000.0, 10.0)

#### Dropping the entire table (Careful: Won't be able to retrieve it!)

In [79]:
cur.execute("DROP TABLE stock")
## Looking at the table
for row in cur.execute("SELECT * FROM stock"):
    print(row) ## This will show an error since the table stock has been dropped

OperationalError: no such table: stock

In [80]:
# Close the connection before closing the file
con.close()

<a id="sec7"></a>

### Section 7: JOINing related tables

I'll start by creating two tables- **students** and **student_grades**

In [81]:
## Making new database student_grades.db:
con= sqlite3.connect('student_grades.db') # Here the data will be stored in example.db
# Once you have connection, you can create a Cursor object and call its execute() method to perform SQL commands
cur= con.cursor()

In [97]:
# Create a table
cur.execute('''CREATE TABLE students (id integer primary key, first_name TEXT,
    last_name TEXT,
    email TEXT,
    phone TEXT,
    birthdate TEXT) ''')

In [98]:
## Adding data points
cur.execute("INSERT INTO students (first_name, last_name, email, phone, birthdate) VALUES('Peter', 'Rabbit', 'peter@rabbit.com', '555-6666', '2002-06-24')")
cur.execute("INSERT INTO students (first_name, last_name, email, phone, birthdate) VALUES('Alice', 'Wonderland', 'alice@wonderland.com', '555-4444', '2002-07-04')")

In [99]:
## looking at the table
for row in cur.execute("SELECT * FROM students"):
    print(row)

(1, 'Peter', 'Rabbit', 'peter@rabbit.com', '555-6666', '2002-06-24')
(2, 'Alice', 'Wonderland', 'alice@wonderland.com', '555-4444', '2002-07-04')

In [100]:
## Creating student grades table
cur.execute('''CREATE TABLE student_grades (id INTEGER primary key,
    student_id integer,
    test text,
    grade integer) ''')

In [101]:
## Adding data into the table
cur.execute("INSERT INTO student_grades (student_id, test, grade) VALUES (1, 'Nutrition', 95)")
cur.execute("INSERT INTO student_grades (student_id, test, grade) VALUES (2, 'Nutrition', 92)")
cur.execute("INSERT INTO student_grades (student_id, test, grade) VALUES (1, 'Chemistry', 85)")
cur.execute("INSERT INTO student_grades (student_id, test, grade) VALUES (2, 'Chemistry', 95)")

In [102]:
for row in cur.execute("SELECT * FROM student_grades"):
    print(row)

(1, 1, 'Nutrition', 95)
(2, 2, 'Nutrition', 92)
(3, 1, 'Chemistry', 85)
(4, 2, 'Chemistry', 95)

#### Cross Join

In [103]:
for row in cur.execute("SELECT * FROM student_grades, students"):
    print(row)

(1, 1, 'Nutrition', 95, 1, 'Peter', 'Rabbit', 'peter@rabbit.com', '555-6666', '2002-06-24')
(1, 1, 'Nutrition', 95, 2, 'Alice', 'Wonderland', 'alice@wonderland.com', '555-4444', '2002-07-04')
(2, 2, 'Nutrition', 92, 1, 'Peter', 'Rabbit', 'peter@rabbit.com', '555-6666', '2002-06-24')
(2, 2, 'Nutrition', 92, 2, 'Alice', 'Wonderland', 'alice@wonderland.com', '555-4444', '2002-07-04')
(3, 1, 'Chemistry', 85, 1, 'Peter', 'Rabbit', 'peter@rabbit.com', '555-6666', '2002-06-24')
(3, 1, 'Chemistry', 85, 2, 'Alice', 'Wonderland', 'alice@wonderland.com', '555-4444', '2002-07-04')
(4, 2, 'Chemistry', 95, 1, 'Peter', 'Rabbit', 'peter@rabbit.com', '555-6666', '2002-06-24')
(4, 2, 'Chemistry', 95, 2, 'Alice', 'Wonderland', 'alice@wonderland.com', '555-4444', '2002-07-04')

Above does not match the tables on any variables

#### (Implicit) Inner Join

In [104]:
for row in cur.execute("SELECT * FROM student_grades, students WHERE student_grades.student_id= students.id"):
    print(row)

(1, 1, 'Nutrition', 95, 1, 'Peter', 'Rabbit', 'peter@rabbit.com', '555-6666', '2002-06-24')
(2, 2, 'Nutrition', 92, 2, 'Alice', 'Wonderland', 'alice@wonderland.com', '555-4444', '2002-07-04')
(3, 1, 'Chemistry', 85, 1, 'Peter', 'Rabbit', 'peter@rabbit.com', '555-6666', '2002-06-24')
(4, 2, 'Chemistry', 95, 2, 'Alice', 'Wonderland', 'alice@wonderland.com', '555-4444', '2002-07-04')

#### (Explicit) Inner Join

In [105]:
for row in cur.execute("SELECt * FROM students JOIN student_grades ON students.id= student_grades.student_id"):
    print(row)

(1, 'Peter', 'Rabbit', 'peter@rabbit.com', '555-6666', '2002-06-24', 1, 1, 'Nutrition', 95)
(2, 'Alice', 'Wonderland', 'alice@wonderland.com', '555-4444', '2002-07-04', 2, 2, 'Nutrition', 92)
(1, 'Peter', 'Rabbit', 'peter@rabbit.com', '555-6666', '2002-06-24', 3, 1, 'Chemistry', 85)
(2, 'Alice', 'Wonderland', 'alice@wonderland.com', '555-4444', '2002-07-04', 4, 2, 'Chemistry', 95)

In [106]:
for row in cur.execute("SELECT first_name, last_name, email, test, grade FROM students JOIN student_grades ON students.id= student_grades.student_id"):
    print(row)

('Peter', 'Rabbit', 'peter@rabbit.com', 'Nutrition', 95)
('Alice', 'Wonderland', 'alice@wonderland.com', 'Nutrition', 92)
('Peter', 'Rabbit', 'peter@rabbit.com', 'Chemistry', 85)
('Alice', 'Wonderland', 'alice@wonderland.com', 'Chemistry', 95)

In [107]:
## Can combine with WHERE conditionals
for row in cur.execute("SELECT first_name, last_name, email, test, grade FROM students JOIN student_grades ON students.id= student_grades.student_id WHERE grade>90"):
    print(row)

('Peter', 'Rabbit', 'peter@rabbit.com', 'Nutrition', 95)
('Alice', 'Wonderland', 'alice@wonderland.com', 'Nutrition', 92)
('Alice', 'Wonderland', 'alice@wonderland.com', 'Chemistry', 95)

In [108]:
## Prefixing table name can make sure that if there is a variable with same name in both tables, then SQL knows which one to pull
for row in cur.execute("SELECT students.first_name, students.last_name, students.email, student_grades.test, student_grades.grade FROM students JOIN student_grades ON students.id= student_grades.student_id WHERE grade>90"):
    print(row)

('Peter', 'Rabbit', 'peter@rabbit.com', 'Nutrition', 95)
('Alice', 'Wonderland', 'alice@wonderland.com', 'Nutrition', 92)
('Alice', 'Wonderland', 'alice@wonderland.com', 'Chemistry', 95)

#### Outer Joins

In [109]:
## Creating a third table
cur.execute('''CREATE TABLE student_projects (id INTEGER PRIMARY KEY,
    student_id INTEGER,
    title TEXT)''')

In [110]:
## Entering data
cur.execute("INSERT INTO student_projects (student_id, title) VALUES (1, 'Carrotapault')")

In [111]:
for row in cur.execute("SELECT * FROM student_projects"):
    print(row)

(1, 1, 'Carrotapault')

In [112]:
## Inner join
for row in cur.execute("SELECT students.first_name, students.last_name, student_projects.title FROM students JOIN student_projects ON students.id= student_projects.student_id"):
    print(row)

('Peter', 'Rabbit', 'Carrotapault')

In [113]:
## Outer join- makes sure all observations are retained
for row in cur.execute("SELECT students.first_name, students.last_name, student_projects.title FROM students LEFT OUTER JOIN student_projects ON students.id= student_projects.student_id"):
    print(row)

('Peter', 'Rabbit', 'Carrotapault')
('Alice', 'Wonderland', None)

#### Self-joins

In [116]:
## Re-creating students data
# Craete a table
cur.execute('''CREATE TABLE student (id integer primary key, first_name TEXT,
    last_name TEXT,
    email TEXT,
    phone TEXT,
    birthdate TEXT,
    buddy_id INTEGER) ''')

In [117]:
## Adding data into the table
cur.execute("INSERT INTO student VALUES (1, 'Peter', 'Rabbit', 'peter@rabbit.com', '555-6666', '2002-06-24', 2)")
cur.execute("INSERT INTO student VALUES (2, 'Alice', 'Wonderland', 'alice@wonderland.com', '555-4444', '2002-07-04', 1)")
cur.execute("INSERT INTO student VALUES (3, 'Aladdin', 'Lampland', 'aladdin@lampland.com', '555-3333', '2001-05-10', 4)")
cur.execute("INSERT INTO student VALUES (4, 'Simba', 'Kingston', 'simba@kingston.com', '555-1111', '2001-12-24', 3)")

In [118]:
for row in cur.execute("SELECT * FROM student"):
    print(row)

(1, 'Peter', 'Rabbit', 'peter@rabbit.com', '555-6666', '2002-06-24', 2)
(2, 'Alice', 'Wonderland', 'alice@wonderland.com', '555-4444', '2002-07-04', 1)
(3, 'Aladdin', 'Lampland', 'aladdin@lampland.com', '555-3333', '2001-05-10', 4)
(4, 'Simba', 'Kingston', 'simba@kingston.com', '555-1111', '2001-12-24', 3)

In [119]:
## Self-join
for row in cur.execute("SELECT student.first_name,student.last_name, buddies.email as buddy_email FROM student JOIN student buddies ON student.buddy_id=buddies.id"):
    print(row)

('Peter', 'Rabbit', 'alice@wonderland.com')
('Alice', 'Wonderland', 'peter@rabbit.com')
('Aladdin', 'Lampland', 'simba@kingston.com')
('Simba', 'Kingston', 'aladdin@lampland.com')

In [120]:
for row in cur.execute("SELECT * FROM student"):
    print(row)

(1, 'Peter', 'Rabbit', 'peter@rabbit.com', '555-6666', '2002-06-24', 2)
(2, 'Alice', 'Wonderland', 'alice@wonderland.com', '555-4444', '2002-07-04', 1)
(3, 'Aladdin', 'Lampland', 'aladdin@lampland.com', '555-3333', '2001-05-10', 4)
(4, 'Simba', 'Kingston', 'simba@kingston.com', '555-1111', '2001-12-24', 3)

Notice again that the join did not add the columns in the table students. Next lets try to figure out how we can add the buddy_email in student table and see how to convert this table into csv file that can be used for later analysis

In [170]:
## Save or commit changes
#con.commit()

## Creating a new column

Self-join creates a tuple of rows:

In [121]:
list(cur.execute("SELECT student.first_name,student.last_name, buddies.email as buddy_email FROM student JOIN student buddies ON student.buddy_id=buddies.id"))

[('Peter', 'Rabbit', 'alice@wonderland.com'),
 ('Alice', 'Wonderland', 'peter@rabbit.com'),
 ('Aladdin', 'Lampland', 'simba@kingston.com'),
 ('Simba', 'Kingston', 'aladdin@lampland.com')]

Notice the third element is the buddy email that we are after. So let's store that variable in a list vcalled **prox**

In [122]:
## Looking at the table
prox=[]
for row in cur.execute("SELECT student.first_name,student.last_name, buddies.email as buddy_email FROM student JOIN student buddies ON student.buddy_id=buddies.id"):
    print(row[2])
    prox.append(row[2])

alice@wonderland.com
peter@rabbit.com
simba@kingston.com
aladdin@lampland.com

In [123]:
## let's check the list
prox

['alice@wonderland.com',
 'peter@rabbit.com',
 'simba@kingston.com',
 'aladdin@lampland.com']

**METHOD1:** In this method, I'll be updating the value of variable **buddy_email** using the `UPDATE` command. Leter we'll see how to automize this process:

Adding a column name **buddy_email** to the table student

In [124]:
cur.execute("ALTER TABLE student ADD COLUMN buddy_email TEXT")

In [125]:
cur.execute("UPDATE student SET buddy_email=:x WHERE id= 1", {"x": prox[0]})

In [126]:
cur.execute("UPDATE student SET buddy_email=:x WHERE id= 2", {"x": prox[1]})

In [127]:
cur.execute("UPDATE student SET buddy_email=:x WHERE id= 3", {"x": prox[2]})

In [128]:
cur.execute("UPDATE student SET buddy_email=:x WHERE id= 4", {"x": prox[3]})

In [129]:
con.commit()

In [130]:
## Looking at the table
for row in cur.execute("SELECT * FROM student"):
    print(row)

(1, 'Peter', 'Rabbit', 'peter@rabbit.com', '555-6666', '2002-06-24', 2, 'alice@wonderland.com')
(2, 'Alice', 'Wonderland', 'alice@wonderland.com', '555-4444', '2002-07-04', 1, 'peter@rabbit.com')
(3, 'Aladdin', 'Lampland', 'aladdin@lampland.com', '555-3333', '2001-05-10', 4, 'simba@kingston.com')
(4, 'Simba', 'Kingston', 'simba@kingston.com', '555-1111', '2001-12-24', 3, 'aladdin@lampland.com')

### Saving data as csv file

In [131]:
import pandas as pd
db_df = pd.read_sql_query("SELECT * FROM student", con)
db_df.to_csv('student.csv', index=False)

In [132]:
db_df

,id,first_name,last_name,email,phone,birthdate,buddy_id,buddy_email
0,1,Peter,Rabbit,peter@rabbit.com,555-6666,2002-06-24,2,alice@wonderland.com
1,2,Alice,Wonderland,alice@wonderland.com,555-4444,2002-07-04,1,peter@rabbit.com
2,3,Aladdin,Lampland,aladdin@lampland.com,555-3333,2001-05-10,4,simba@kingston.com
3,4,Simba,Kingston,simba@kingston.com,555-1111,2001-12-24,3,aladdin@lampland.com

**METHOD2:**  Here I'm automizing the update process and adding data under variable **buddy_email2**

In [133]:
cur.execute("ALTER TABLE student ADD COLUMN buddy_email2 TEXT")

In [134]:
for i in range(4):
    j= i+1
    y= prox[i]
    cur.execute("UPDATE student SET buddy_email2= ? WHERE id= ?", (y,j))

In [135]:
con.commit()

In [136]:
## Looking at the table
for row in cur.execute("SELECT * FROM student"):
    print(row)

(1, 'Peter', 'Rabbit', 'peter@rabbit.com', '555-6666', '2002-06-24', 2, 'alice@wonderland.com', 'alice@wonderland.com')
(2, 'Alice', 'Wonderland', 'alice@wonderland.com', '555-4444', '2002-07-04', 1, 'peter@rabbit.com', 'peter@rabbit.com')
(3, 'Aladdin', 'Lampland', 'aladdin@lampland.com', '555-3333', '2001-05-10', 4, 'simba@kingston.com', 'simba@kingston.com')
(4, 'Simba', 'Kingston', 'simba@kingston.com', '555-1111', '2001-12-24', 3, 'aladdin@lampland.com', 'aladdin@lampland.com')

In [139]:
cur.execute('PRAGMA TABLE_INFO(student)')
[tup[1] for tup in cur.fetchall()]

['id',
 'first_name',
 'last_name',
 'email',
 'phone',
 'birthdate',
 'buddy_id',
 'buddy_email',
 'buddy_email2']

#### Combining multiple joins

In [140]:
for row in cur.execute("SELECT * FROM student"):
    print(row)

(1, 'Peter', 'Rabbit', 'peter@rabbit.com', '555-6666', '2002-06-24', 2, 'alice@wonderland.com', 'alice@wonderland.com')
(2, 'Alice', 'Wonderland', 'alice@wonderland.com', '555-4444', '2002-07-04', 1, 'peter@rabbit.com', 'peter@rabbit.com')
(3, 'Aladdin', 'Lampland', 'aladdin@lampland.com', '555-3333', '2001-05-10', 4, 'simba@kingston.com', 'simba@kingston.com')
(4, 'Simba', 'Kingston', 'simba@kingston.com', '555-1111', '2001-12-24', 3, 'aladdin@lampland.com', 'aladdin@lampland.com')

In [141]:
for row in cur.execute("SELECT * FROM student_projects"):
    print(row)

(1, 1, 'Carrotapault')

In [142]:
## Adding more data into student_projects table
## Entering data
cur.execute("INSERT INTO student_projects (student_id, title) VALUES (2, 'Mad Hattery')")
cur.execute("INSERT INTO student_projects (student_id, title) VALUES (3, 'Carpet Physics')")
cur.execute("INSERT INTO student_projects (student_id, title) VALUES (4, 'Hyena Habitats')")

In [143]:
for row in cur.execute("SELECT * FROM student_projects"):
    print(row)

(1, 1, 'Carrotapault')
(2, 2, 'Mad Hattery')
(3, 3, 'Carpet Physics')
(4, 4, 'Hyena Habitats')

In [144]:
## Creating new table project_pairs
cur.execute('''CREATE TABLE project_pairs (id INTEGER primary key, project1_id INTEGER, project2_id INTEGER)''')

In [145]:
## Adding more data into  table
## Entering data
cur.execute("INSERT INTO project_pairs (project1_id, project2_id) VALUES (1,2)")
cur.execute("INSERT INTO project_pairs (project1_id, project2_id) VALUES (3, 4)")

In [146]:
for row in cur.execute("SELECT * FROM project_pairs"):
    print(row)

(1, 1, 2)
(2, 3, 4)

In [147]:
## Objective is to write the title of the two projects
for row in cur.execute("SELECT * FROM project_pairs JOIN student_projects ON project_pairs.project1_id=student_projects.student_id"):
    print(row)

(1, 1, 2, 1, 1, 'Carrotapault')
(2, 3, 4, 3, 3, 'Carpet Physics')

In [148]:
for row in cur.execute("SELECT * FROM project_pairs JOIN student_projects a ON project_pairs.project1_id=a.student_id JOIN student_projects b ON project_pairs.project2_id=b.student_id"):
    print(row)

(1, 1, 2, 1, 1, 'Carrotapault', 2, 2, 'Mad Hattery')
(2, 3, 4, 3, 3, 'Carpet Physics', 4, 4, 'Hyena Habitats')

In [149]:
## Time for self-join
for row in cur.execute("SELECT a.title,b.title FROM project_pairs JOIN student_projects a ON project_pairs.project1_id=a.student_id JOIN student_projects b ON project_pairs.project2_id=b.student_id"):
    print(row)

('Carrotapault', 'Mad Hattery')
('Carpet Physics', 'Hyena Habitats')

In [150]:
con.commit()

In [151]:
con.close()

<a id="sec8"></a>

### Section 8:  Writing Transactions

In [153]:
## Putting it all together
import sqlite3
con= sqlite3.connect('transaction_example.db') 
# Once you have connection, you can create a Cursor object and call its execute() method to perform SQL commands
cur= con.cursor()

In [154]:
cur.execute("begin")
try:
    cur.execute("DROP TABLE IF EXISTS diary_logs")
    cur.execute("CREATE TABLE diary_logs (id INTEGER primary key, user_id INTEGER, date TEXT, content TEXT)")
    cur.execute("INSERT INTO diary_logs (user_id, date, content) VALUES (1, '2015-04-01', 'I had a horrible fight with OhNoesGuy and I buried my woes in 3 pounds of dark chocolate.')")
    cur.execute("INSERT INTO diary_logs (user_id, date, content) VALUES (1, '2015-04-02', 'We made up and now we are best friends forever and we celebrated with a tub of ice cream')")
    cur.execute("UPDATE diary_logs SET content= 'I had a horrible fight with OhNoesGuy' WHERE user_id=1 AND date= '2015-04-01'")
    #cur.execute("UPDATE diary_logs SET content= 'I had a fine day' WHERE user_id=1 AND date= '2015-04-01'")
    cur.execute("commit")
except con.Error:
    print("failed!")
    cur.execute("rollback")

In [155]:
for row in cur.execute("SELECT * FROM diary_logs"):
    print(row)

(1, 1, '2015-04-01', 'I had a horrible fight with OhNoesGuy')
(2, 1, '2015-04-02', 'We made up and now we are best friends forever and we celebrated with a tub of ice cream')

In [156]:
con.close()

#### Alternative is to use connection objects as context managers; however this is more inefficient

In [157]:
import sqlite3

filename= 'transaction_example.db'

with sqlite3.connect(filename) as con:
    cur= con.cursor()
    sqls= [
        "DROP TABLE IF EXISTS diary_logs",
        "CREATE TABLE diary_logs (id INTEGER primary key, user_id INTEGER, date TEXT, content TEXT)",
        "INSERT INTO diary_logs (user_id, date, content) VALUES (1, '2015-04-01', 'I had a horrible fight with OhNoesGuy and I buried my woes in 3 pounds of dark chocolate.')",
        "INSERT INTO diary_logs (user_id, date, content) VALUES (1, '2015-04-02', 'We made up and now we are best friends forever and we celebrated with a tub of ice cream')"
    ]
    for sql in sqls:
        cur.execute(sql)

try:
    with sqlite3.connect(filename) as con:
        cur=con.cursor()
        sqls= [
            "UPDATE diary_logs SET content= 'I had a horrible fight with OhNoesGuy' WHERE user_id=1 AND date= '2015-04-01'",
            "UPDATE diary_logs SET content= 'I had a fine day' WHERE user_id=1 AND date= '2015-04-01'",
        ]
        for sql in sqls:
            cur.execute(sql)
            
except sqlite3.OperationalError as err:
    print(err)
    
with sqlite3.connect(filename) as con:
    cur= con.cursor()
    for row in cur.execute("SELECT * FROM diary_logs"):
        print(row)

(1, 1, '2015-04-01', 'I had a fine day')
(2, 1, '2015-04-02', 'We made up and now we are best friends forever and we celebrated with a tub of ice cream')

In [158]:
con.close()